{
    "id": 555824447530,
    "title": "Exploring Persian Culture with Sara Kardan, Co-Founder of Majesty Pleasure",
    "created_at": "2021-10-08T16:14:46-04:00",
    "content": "\u003cdiv style=\"text-align: center;\"\u003e\u003cspan style=\"font-weight: 400;\"\u003eThe month of October is dedicated to our newest collection Persia.  If you read our \u003ca href=\"https:\/\/shop437.com\/blogs\/blog\/storytelling-with-persia\" target=\"_blank\" title=\"Storytelling with Persia\" rel=\"noopener noreferrer\"\u003emost recent blog post,\u003c\/a\u003e you know that this collection is inspired by our CEO \u003ca href=\"https:\/\/www.instagram.com\/hylanayeri\/\" target=\"_blank\" title=\"Hyla Nayeri\" rel=\"noopener noreferrer\"\u003eHyla’s\u003c\/a\u003e heritage. \u003c\/span\u003e\u003c\/div\u003e\n\u003cbr\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003cspan style=\"font-weight: 400;\"\u003e\u003ca href=\"https:\/\/shop437.com\/collections\/persia\" target=\"_blank\" title=\"Persia Collection\" rel=\"noopener noreferrer\"\u003eThe Persia Collection\u003c\/a\u003e is meant to involve feelings of family, warmth and rich tradition. It is meant to inspire us to deeply connect with our heritages and see the beauty in all that it has to offer. \u003c\/span\u003e\u003c\/div\u003e\n\u003cbr\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003cspan style=\"font-weight: 400;\"\u003eWith that in mind, Hyla’s connection to her Persian heritage as an Iranian woman is just one of many experiences. We had the opportunity to connect with other Canadian-Persian women who are trailblazers in their respective industries to learn more about the culture.\u003c\/span\u003e\u003c\/div\u003e\n\u003cbr\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003cspan style=\"font-weight: 400;\"\u003e\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003cspan style=\"font-weight: 400;\"\u003e\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003cspan style=\"font-weight: 400;\"\u003eOur first interview was with \u003ca href=\"https:\/\/www.instagram.com\/sarakardan\/\" target=\"_blank\" title=\"Sara Kardan\" rel=\"noopener noreferrer\"\u003eSara Kardan\u003c\/a\u003e, a personal inspiration of Hyla's and the Co-Founder of the luxury Toronto-based nail and beauty spa \u003ca href=\"https:\/\/www.instagram.com\/majestyspleasure\/\" target=\"_blank\" title=\"Majesty's Pleasure\" rel=\"noopener noreferrer\"\u003eMajesty's Pleasure\u003c\/a\u003e. We had so much fun exploring the Persian culture from her eyes and we know you will too. Keep reading to learn more about Sara and her experiences!\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003cspan style=\"font-weight: 400;\"\u003e\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003cspan style=\"font-weight: 400;\"\u003e \u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003cspan style=\"font-weight: 400;\"\u003e\u003cimg src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/2112\/6981\/files\/Untitled_design_4.png?v=1633726052\" alt=\"\" width=\"260\" height=\"260\"\u003e\u003cimg src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/2112\/6981\/files\/2_c31ea8a4-6e47-421c-bcce-1e49b56e9244.png?v=1633725072\" alt=\"\" width=\"260\" height=\"260\"\u003e\u003cimg src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/2112\/6981\/files\/7_57ab3b57-9a52-42ff-95a2-4eb7d4679c2b.png?v=1633726008\" alt=\"\" width=\"260\" height=\"260\"\u003e\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003cspan style=\"font-weight: 400;\"\u003e\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\n\u003cp class=\"p1\"\u003e\u003ci\u003eI was born in a big and busy city in Iran called Tehran in; same as my mother.  My dad is from another city called Isfahan which is well known for its art \u0026amp; Architecture.  \u003c\/i\u003e\u003ci\u003eGrowing up, there were times where I wasn't sure which city I belonged to as there were aspects of each city I really liked. - Sara Kardan\u003c\/i\u003e\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e\u003cstrong\u003eHyla \u0026amp; 437:\u003c\/strong\u003e Thank you for taking some time to to chat with us today. We are so excited to be collaborating with Majesty's Pleasure on such a special collection that is so close to our heart and to yours. Do you want to start by giving us a bit of background on yourself?\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e\u003cstrong\u003eSara:\u003c\/strong\u003e Absolutely. I am thrilled to be doing this with you and 437.\u003c\/p\u003e\n\u003cp class=\"p1\"\u003eI am one of the Co-Founders of Majesty's Pleasure. We are a Toronto-based (located in Yorkville and King Street W) spa, salon and cocktail lounge. We opened the business about 7 years ago. My husband and I quit our jobs to open up MP because we felt that there was a huge gap in the beauty industry that we could fill.\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e\u003cstrong\u003eUs:\u003c\/strong\u003e Majesty's Pleasure is the most beautiful spa\/salon we've ever been to. That's why we wanted to collaborate with you on something so special. How does your Persian Heritage influence your brand and the work you do?\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e\u003cstrong\u003eSara:\u003c\/strong\u003e Persians \u003cem\u003ealways\u003c\/em\u003e strive to be the best and education is a pillar of Persian Culture. Growing up, it was so important to my family that I receive a good education and work hard in any and every thing I did. They were always very open to what fields we wanted to study growing up and I chose Interior Design and Architecture. I've always been inspired by the beautiful things around me. There is thousands of years worth of beautiful and detailed Persian designs. I've always aimed to create the best atmospheres and experiences possible; I know this is a desire brought on by my culture.\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e\u003cem\u003e(﻿Editors note: a quick visit to MP emphasizes her passion for Interior Design and Architecture. Both locations are beautifully curated to invoke feelings of luxury and comfort)\u003c\/em\u003e\u003c\/p\u003e\n\u003cp class=\"p1\"\u003eMy strong work ethic was also formulated through my culture. It was essential for me to be able to work hard so that I could survive being a start-up in a city like Toronto. \u003c\/p\u003e\n\u003cp class=\"p1\"\u003eFinally, at the forefront of Majesty's Pleasure's values is our customer service. Customer service is everything to me. Being Persian, house warming and hosting is a huge part of the culture. \u003ci\u003e \u003c\/i\u003eOur culture loves to create a social setting, we are a very social culture and I think that is evident in what we try and do at Majesty’s Pleasure with our guests!\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e\u003cimg src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/2112\/6981\/files\/4_10449e8f-9a0e-4084-bdc3-4ae2206631a9.png?v=1633727317\" alt=\"\" width=\"300\" height=\"300\"\u003e\u003cimg src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/2112\/6981\/files\/3_5d5a74dd-dc38-44ef-892f-4182dd8f7031.png?v=1633725083\" alt=\"\" width=\"300\" height=\"300\"\u003e\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e\u003cstrong\u003eUs: \u003c\/strong\u003eTell us a little bit about your heritage and family background.\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e\u003cstrong\u003e﻿Sara:\u003c\/strong\u003e﻿  I was born in a big and busy city called Tehran in Iran, same as my mother.  My dad is from another city called Isfahan which is well known for its art \u0026amp; Architecture.  Isfahan is much more conservative and Tehran is a more open-minded. Growing up, there were times where I wasn't sure which city I belonged to as there were aspects of each city I really liked.  And both my parents are very much like the city they are from.  I emigrated to Canada with my family when I was 7 and my dad lived half in Iran and half in Cana a because of work. My parents are very supportive and loving people and have always pushed us to be the very best.\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e\u003cstrong\u003eUs: \u003c\/strong\u003eSince you moved to Canada from Iran at a young age, how did living in North America change your understanding of yourself?\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e\u003cstrong\u003e﻿Sara: \u003c\/strong\u003eI moved to Canada when I was 7 because my parents wanted to give me more educational opportunities. It was  difficult at first because I didn't feel like I fit in at the time. I was the only Persian girl in my school and I didn't look like everyone else. It's funny, because now my differences are what I love about myself. I like that I  (for example) have thick brows. This is something that I try to highlight and celebrate with my daughter now.\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e\u003cstrong\u003eUs:\u003c\/strong\u003e How do you stay connected to your Persian root?\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e\u003cstrong\u003eSara:\u003c\/strong\u003e I'll be honest, it hasn't always been easy. One thing I am thankful for is that my parents made sure we went back to Iran every summer for 3 months. It was a good way to stay connected to our culture and our extended family. I've been trying to do the same now with my kids, but it's difficult with the travel restrictions. Right now, I try to stay connected to my Iranian heritage by celebrating the food and culture. I go to Persian grocery stores for all the specialty breads, meats, fruits and spices. I also  celebrate the big holidays like\u003ca href=\"https:\/\/www.cnn.com\/travel\/article\/nowruz-2021-explainer-trnd\/index.html\" target=\"_blank\" title=\"Nowruz 2021\" rel=\"noopener noreferrer\"\u003e Nowruz\u003c\/a\u003e with my husband and kids. I try to make it fun for them and show them how exciting Persian culture can be!\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e\u003cstrong\u003eUs:\u003c\/strong\u003e What are your favourite parts of Persian Culture?\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e\u003cstrong\u003eSara:\u003c\/strong\u003e There are \u003cem\u003eso\u003c\/em\u003e many things I absolutely adore about my culture. I'd have to say its:\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e1. The Traditional Holidays.  I \u003cem\u003elove\u003c\/em\u003e Nowruz (our New Year). It's a beautiful holiday about celebrating rebirth, renewal, and the Spring season.\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e2. The People and the humour between us from all of our different regions.\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e3.  The Classical Persian Music. I grew up listening to this and have fond memories of my mom cooking in the kitchen to it.\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e4. The food. There's really nothing else like it in the world. We use the most flavourful spices in all of our dishes and they have the best health benefits. Spices like cardamom, turmeric and saffron are so full of flavour and are staples in our dishes. It's really magical. And of course if you haven't tried Persian Kebab you must.\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e5. Picnics. Picnicking is a popular Persian activity and everyone has childhood memories of them. We have holidays where all you do is spend time with your family outside eating on a rug\/blanket. It's a blessing to spend time with your family like that.\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e\u003cstrong\u003e\u003c\/strong\u003e6. Persian Tea. I drink about 4 cups a day.\u003c\/p\u003e\n\u003cp class=\"p1\"\u003eand finally,\u003cstrong\u003e 7. Persian Passion. \u003c\/strong\u003eMy father is an entrepreneur in textiles and he's always told me that \u003cspan style=\"text-decoration: underline;\"\u003e\u003cstrong\u003enothing is impossible.\u003cem\u003e \u003c\/em\u003e\u003c\/strong\u003e\u003c\/span\u003e\u003cstrong\u003e\u003cem\u003e\u003c\/em\u003e\u003c\/strong\u003eI've grown up believing I can do whatever I want in life. My grandmother is also a huge inspiration for me. She didn't have the best upbringing but she always positively influenced from a young age. She would always tell me to do what I love and to never let anyone tell me I couldn't do something. She inspired me not to take no for an answer. From a young age she always believed in me; it's kind of like she knew my future. \u003c\/p\u003e\n\u003cp class=\"p1\"\u003eShe instilled this mentality into me from a young age and it has shaped my confidence and allowed me to do what I love every day.\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e\u003cimg src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/2112\/6981\/files\/8_69d086ef-9fa3-4a04-8b70-e9c56b8f262a.png?v=1633728626\" alt=\"\" width=\"450\" height=\"450\"\u003e\u003c\/p\u003e\n\u003cp class=\"p1\"\u003eTo learn more about Sara, please check out our full interview with her \u003ca href=\"https:\/\/www.instagram.com\/tv\/CUqTmVFpCNB\/\" target=\"_blank\" title=\"Majesty's Pleasure and 437\" rel=\"noopener noreferrer\"\u003ehere\u003c\/a\u003e.\u003c\/p\u003e\n\u003cp class=\"p1\"\u003eThe Majesty's Pleasure Yorkville location is now selling select quantities of our newest collection Persia!\u003c\/p\u003e\n\u003cp class=\"p1\"\u003e \u003c\/p\u003e\n\u003c\/div\u003e",
    "blog_id": 91921163,
    "author": "Tomachi Onyewuchi",
    "user_id": 41051553834,
    "published_at": "2021-10-08T17:33:21-04:00",
    "updated_at": "2021-10-08T17:33:21-04:00",
    "summary_html": "",
    "template_suffix": "",
    "handle": "exploring-persian-culture-with-sara-kardan-co-founder-of-majesty-pleasure",
    "tags": "437, 437 at home, 437 babes, 437 Brand, 437 community, 437 swim wear, 437 swimwear, 437 team, 437swim, bikini collection, bikini season, buttery soft, cheeky cut swim, cocoa bikini, curve hugging, espresso swimwear, f\/w2021, holiday shopping, hyla, Hyla Nayeri, inspiration, inspo, majesty pleasure, persia, persia collection, persian, persian rugs, persian woman, persian women, small businesses, staple swim, swimwear, swimwear collection, WOC brands, WOC leaders, women in power, women of colour fashion",
    "admin_graphql_api_id": "gid:\/\/shopify\/OnlineStoreArticle\/555824447530",
    "image": {
        "created_at": "2021-10-08T16:14:46-04:00",
        "alt": "",
        "width": 1080,
        "height": 1080,
        "aspect_ratio": 2.1,
        "src": "https:\/\/cdn.shopify.com\/s\/files\/1\/2112\/6981\/articles\/1_2210694c-3274-44ce-9e92-2f45402b7913.png?v=1633724087"
    }
}