{
    "id": 36658774104,
    "title": "Meet Derin Falana",
    "created_at": "2019-10-11T07:23:36-04:00",
    "content": "\u003cdiv class=\"row full-width\"\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cstrong\u003eWhen did you start your music journey, and what inspired you to start?\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eI'm a rapper\/singer. I started music around my last year of high school. I used to put out freestyles over industry beats and then started creating original music. My homies and the people around me at the time inspired me to start and the support I got from starting kept me going. \u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eFor someone who has never heard your music before, how would you describe your sound to them?\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eI would describe my sound as a blend between melody and rap.\u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat was your inspiration behind your latest album \u003cem\u003eDon't Save Me\u003c\/em\u003e?\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eThe inspiration behind my latest album came from the transition period that was happening in my life. The new experiences and balancing the ups and downs that came with them.\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/fw19-med-2.jpg?3992\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns blog-pad\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/fw19-med-4.jpg?3992\"\u003e\u003c\/div\u003e\n\u003chr class=\"hr-none\" style=\"clear: both;\"\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cstrong\u003eWhat has been the biggest struggle you have faced when writing your latest album \u003cem\u003eDon't Save Me\u003c\/em\u003e, and how did you overcome it? \u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eThe biggest struggle was just piecing everything together. Making sure songs turned out the way I envisioned and sticking through the rough patches creatively. Patience definitely allowed me to overcome this. As a creative there is no time limit on your art so it's ready when you feel it's ready.\u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat helps you maintain your drive, preventing burn-out? What motivates you each day to keep doing what you’re doing? \u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eSupporters motivate me to keep going. Daily messages from people that rock with me and let me know how my music has affected them in a positive way. Breaks are necessary to prevent myself from burning out. Finding that balance between living and working is important.\u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat has been the hardest decision you have had to make so far in your journey of being a musician?\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eI think the hardest decisions I've had to make so far have just been sacrifices and deciding whether or not you really want it because if you do, you're going to lose some things and people along the way that you may not be willing to give up.\u003c\/p\u003e\n\u003cp style=\"text-align: left;\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/fw19-large-8_2048x2048.jpg?v=1570635095\" style=\"float: none;\"\u003e\u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"row full-width\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cstrong\u003eHow has growing up in Brampton influenced your sound? \u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eCreatives who grow up in the suburbs tend to stay inside and work on a craft or research things. I would say growing up in Brampton influenced me in this way. Listening to different styles of music all day and watching YouTube videos of hip-hop\/R\u0026amp;B from a young age. I would eventually study those and when I started creating I was subconsciously pulling from that because it was what I knew.\u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat advice would you give to young artists trying to become a musician but don't know where to start? \u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eFocus on the music. The music matters the most. Make sure your effort goes into making sure you're creating the best music possible. Everything else comes after.\u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhere is your favourite place to be in Toronto when you have the day to yourself?\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eI've been at Warehouse a handful of times in the last couple of months. other than the studio, it might be there right now.\u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow would you describe your growth musically from your first project to this one? \u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eMy melodies have gotten stronger, lyrically I've improved and my content has changed because I've changed as a person and continue to change.\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/fw19-med-7.jpg?3992\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns blog-pad\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/fw19-sm-4.jpg?3992\"\u003e\u003c\/div\u003e\n\u003chr class=\"hr-none\" style=\"clear: both;\"\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cstrong\u003eWhat’s your favourite track off of \u003cem\u003eDon’t Save Me\u003c\/em\u003e?\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eIt's always changing. Right now it's \u003cem\u003eCan't Get Enough\u003c\/em\u003e.\u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eAt what point did you realize you wanted to be a full-time musician and how did those around you react?\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eIt was in 2016 around the release of my first project. Ended up leaving my job and haven't looked back since. Some people supported me and others questioned my decision but I felt like it was the right thing to do for myself. \u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat does Home is Toronto mean to you? \u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eHome is Toronto literally means that. Home team. This is a special place and a lot of great things have come out of here that have impacted and influenced the world forever.\u003c\/p\u003e\n\u003c\/div\u003e\n\u003c\/div\u003e",
    "blog_id": 22647472216,
    "author": "Yanal Dhailieh",
    "user_id": 5774835,
    "published_at": "2019-10-11T11:57:00-04:00",
    "updated_at": "2019-10-13T16:27:04-04:00",
    "summary_html": "",
    "template_suffix": null,
    "handle": "meet-derin-falana",
    "tags": "",
    "admin_graphql_api_id": "gid:\/\/shopify\/OnlineStoreArticle\/36658774104",
    "image": {
        "created_at": "2019-10-13T16:24:47-04:00",
        "alt": "",
        "width": 2000,
        "height": 1333,
        "aspect_ratio": 0.8,
        "src": "https:\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/articles\/KOA_0995_1_copy.jpg?v=1570998287"
    }
}