{
    "title": "New Posts",
    "articles": [
        {
            "id": 36658774104,
            "title": "Meet Derin Falana",
            "created_at": "2019-10-11T07:23:36-04:00",
            "body_html": "\u003cdiv class=\"row full-width\"\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cstrong\u003eWhen did you start your music journey, and what inspired you to start?\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eI'm a rapper\/singer. I started music around my last year of high school. I used to put out freestyles over industry beats and then started creating original music. My homies and the people around me at the time inspired me to start and the support I got from starting kept me going. \u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eFor someone who has never heard your music before, how would you describe your sound to them?\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eI would describe my sound as a blend between melody and rap.\u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat was your inspiration behind your latest album \u003cem\u003eDon't Save Me\u003c\/em\u003e?\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eThe inspiration behind my latest album came from the transition period that was happening in my life. The new experiences and balancing the ups and downs that came with them.\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/fw19-med-2.jpg?3992\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns blog-pad\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/fw19-med-4.jpg?3992\"\u003e\u003c\/div\u003e\n\u003chr class=\"hr-none\" style=\"clear: both;\"\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cstrong\u003eWhat has been the biggest struggle you have faced when writing your latest album \u003cem\u003eDon't Save Me\u003c\/em\u003e, and how did you overcome it? \u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eThe biggest struggle was just piecing everything together. Making sure songs turned out the way I envisioned and sticking through the rough patches creatively. Patience definitely allowed me to overcome this. As a creative there is no time limit on your art so it's ready when you feel it's ready.\u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat helps you maintain your drive, preventing burn-out? What motivates you each day to keep doing what you’re doing? \u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eSupporters motivate me to keep going. Daily messages from people that rock with me and let me know how my music has affected them in a positive way. Breaks are necessary to prevent myself from burning out. Finding that balance between living and working is important.\u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat has been the hardest decision you have had to make so far in your journey of being a musician?\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eI think the hardest decisions I've had to make so far have just been sacrifices and deciding whether or not you really want it because if you do, you're going to lose some things and people along the way that you may not be willing to give up.\u003c\/p\u003e\n\u003cp style=\"text-align: left;\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/fw19-large-8_2048x2048.jpg?v=1570635095\" style=\"float: none;\"\u003e\u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"row full-width\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cstrong\u003eHow has growing up in Brampton influenced your sound? \u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eCreatives who grow up in the suburbs tend to stay inside and work on a craft or research things. I would say growing up in Brampton influenced me in this way. Listening to different styles of music all day and watching YouTube videos of hip-hop\/R\u0026amp;B from a young age. I would eventually study those and when I started creating I was subconsciously pulling from that because it was what I knew.\u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat advice would you give to young artists trying to become a musician but don't know where to start? \u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eFocus on the music. The music matters the most. Make sure your effort goes into making sure you're creating the best music possible. Everything else comes after.\u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhere is your favourite place to be in Toronto when you have the day to yourself?\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eI've been at Warehouse a handful of times in the last couple of months. other than the studio, it might be there right now.\u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow would you describe your growth musically from your first project to this one? \u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eMy melodies have gotten stronger, lyrically I've improved and my content has changed because I've changed as a person and continue to change.\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/fw19-med-7.jpg?3992\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns blog-pad\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/fw19-sm-4.jpg?3992\"\u003e\u003c\/div\u003e\n\u003chr class=\"hr-none\" style=\"clear: both;\"\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cstrong\u003eWhat’s your favourite track off of \u003cem\u003eDon’t Save Me\u003c\/em\u003e?\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eIt's always changing. Right now it's \u003cem\u003eCan't Get Enough\u003c\/em\u003e.\u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eAt what point did you realize you wanted to be a full-time musician and how did those around you react?\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eIt was in 2016 around the release of my first project. Ended up leaving my job and haven't looked back since. Some people supported me and others questioned my decision but I felt like it was the right thing to do for myself. \u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat does Home is Toronto mean to you? \u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eHome is Toronto literally means that. Home team. This is a special place and a lot of great things have come out of here that have impacted and influenced the world forever.\u003c\/p\u003e\n\u003c\/div\u003e\n\u003c\/div\u003e",
            "blog_id": 22647472216,
            "author": "Yanal Dhailieh",
            "user_id": 5774835,
            "published_at": "2019-10-11T11:57:00-04:00",
            "updated_at": "2019-10-13T16:27:04-04:00",
            "summary_html": "",
            "template_suffix": null,
            "handle": "meet-derin-falana",
            "tags": "",
            "admin_graphql_api_id": "gid:\/\/shopify\/OnlineStoreArticle\/36658774104",
            "image": {
                "created_at": "2019-10-13T16:24:47-04:00",
                "alt": "",
                "width": 2000,
                "height": 1333,
                "aspect_ratio": 0.8,
                "src": "https:\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/articles\/KOA_0995_1_copy.jpg?v=1570998287"
            }
        },
        {
            "id": 30403264600,
            "title": "Akil Augustine",
            "created_at": "2019-09-06T14:06:03-04:00",
            "body_html": "\u003cdiv class=\"row full-width\"\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cb\u003eTell us a little bit about yourself - for example, growing up what were your interests? Have they changed or did you always have a main concept\/idea in your mind that you wanted to achieve?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eFrom as early as I can remember, I have always wanted to put on a show! I think I saw Eddie Murphy’s first stand up and said, that’s it show business for me. I’ve been the class clown ever since. \u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cb\u003eWhat’s your day to day like when there is anything basketball-related going on? \u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eI usually meditate and do research until it’s showtime!\u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cb\u003eWhat first sparked your interest in the game of basketball? And eventually transitioning over to the broadcast\/producing side of things?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eMy cousin introduced me to the game and there was a huge community of guys he knew that played throughout the city tournaments. I looked up to them and aspired to be like them. When I moved to Toronto from Trinidad (there was some culture shock) there weren’t many visible representations of black males around, and not having my dad present, I looked up to the players as examples.\u003c\/span\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/akil-5.jpg?3075\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns blog-pad\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/akil-8.jpg?3075\"\u003e\u003c\/div\u003e\n\u003chr class=\"hr-none\" style=\"clear: both;\"\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cb\u003eWhen you have some time to unwind, where can we usually find Akil hanging in the city?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eMy couch; meditating. \u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cb\u003eWhat adversities have you faced throughout your journey to where you are today?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eAll of them from legal to mental to spiritual. I’ll save most of the details for my book. \u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cb\u003eDid you ever have moments where you felt like maybe you were on the wrong path?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eNever the wrong path, sometimes I’ve felt like I wasn’t moving at the speed I wanted to be living at. But I’ve been in the right path most of my adulthood.\u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cb\u003eWhat would you say is the greatest change you’ve made that’s impacted your life?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eMeditation.\u003c\/span\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"row full-width\"\u003e\u003cimg src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/akil-1.jpg?3075\" alt=\"\" style=\"display: block; margin-left: auto; margin-right: auto;\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cb\u003eDealing with being the producer\/creator\/host of the hangout, what are some ways you find to deal with the stress that can build-up when filming a show?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eAfter filming I need one to come down. I ramp myself up a lot to have high energy for the shows and it takes a while to come down. So it’s hard to be around people when you're shifting gears. That can be stressful for me personally.\u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cb\u003eHow do you find ways to keep up with your personal life when there’s a lot going on?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eMeditating. \u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cb\u003eWhat’s it like seeing the growth of Canadian basketball in all its entirety today?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eFunny. For some of us we saw it happening and tried to tell people. So it’s humorous how impressed people are now to me. \u003c\/span\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/akil-7.jpg?3075\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns blog-pad\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/akil-4.jpg?3075\"\u003e\u003c\/div\u003e\n\u003chr class=\"hr-none\" style=\"clear: both;\"\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cb\u003eWhat advice would you give to young people around Canada that really want to jump into the broadcasting\/producing world of sports?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eStart your own shit!\u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cb\u003eWhat has been the most memorable moment in your journey to date?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eInterviewing Kawhi on the team bus during the parade. Honourable mention to hosting Jurrasic Park!\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cb\u003eWhen you’re hosting Jurassic park how much of the energy is you vs. the energy you get back from the fans?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e50\/50.\u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cb\u003eWhat would you say your personal style is?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e90's hoodman in tight pants.\u003c\/span\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"row full-width\"\u003e\u003cimg src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/akil-3.jpg?3075\" alt=\"\" style=\"display: block; margin-left: auto; margin-right: auto;\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cb\u003eIf you could live anywhere in the world, where would it be?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eToronto… or Hawaii.\u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cb\u003eWhat does Home is Toronto mean to you? How has this city helped shape who you are today?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eI have a pretty odd collection of interests and passions and I owe that to the fact that Toronto has exposed me to a lot, and has allowed me to pursue those interests. It’s a great environment to grow in.\u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cb\u003eWhat about the city inspires you the most?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eWhere we’re going.\u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cb\u003eWhere is your favourite place to be in Toronto when you have the day to yourself?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eRiverdale Park.\u003c\/span\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003c\/div\u003e",
            "blog_id": 22647472216,
            "author": "Yanal Dhailieh",
            "user_id": 5774835,
            "published_at": "2019-09-06T15:48:00-04:00",
            "updated_at": "2019-09-06T15:48:33-04:00",
            "summary_html": "",
            "template_suffix": null,
            "handle": "akil-augustine",
            "tags": "",
            "admin_graphql_api_id": "gid:\/\/shopify\/OnlineStoreArticle\/30403264600",
            "image": {
                "created_at": "2019-09-06T15:38:19-04:00",
                "alt": "",
                "width": 1700,
                "height": 1133,
                "aspect_ratio": 0.8,
                "src": "https:\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/articles\/akil-2.jpg?v=1567798699"
            }
        },
        {
            "id": 30063329368,
            "title": "Meet Jonathan Osorio",
            "created_at": "2019-08-28T14:40:38-04:00",
            "body_html": "\u003cdiv class=\"row full-width\"\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cb\u003eTell us a little bit about yourself - for example, growing up what were your interests? Have they changed or did you always have a main concept\/idea in your mind that you wanted to achieve?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eAs a child I always loved playing soccer and it was always my ambition to become a professional footballer. I also enjoyed playing other sports while growing up such as, basketball and baseball. \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003cp\u003e\u003cb\u003eWhat’s your day to day like, since it might not be the same every day, what does an overview of your week look like?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eTraining every morning from Tuesday to Friday, games usually on Saturday, training on Sunday, and Monday is an OFF day. Away from training I keep myself busy with different things such as meeting up with friends, having a coffee at a cafe, etc.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e  \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cb\u003eWhat first sparked your interest in soccer?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eMy father’s love for the sport got passed on to me. I always loved going to his soccer games to watch him play, and then go on the field at halftime to play with the other kids. \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cb\u003eWhat do you seek inspiration from when it comes to mastering your skills and ability to perform at a high level? Is it the people around you, your family, your Journey?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eMy family is definitely my biggest inspiration. They inspire me to be the best possible version of myself both on and off the field. I also get inspiration from other footballers around the world whom I look up to.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/tfc-med-10.jpg?3064\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns blog-pad\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/tfc2-med-22.jpg?3064\"\u003e\u003c\/div\u003e\n\u003chr class=\"hr-none\" style=\"clear: both;\"\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cb\u003eWhen the lights are dimmed down, and you have time to unwind, what can we usually find Jonathan Osorio doing?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eI really enjoy doing sudoku puzzles. Some days I like to take a walk, find a bench somewhere in the park and try to finish 2-3 puzzles before calling friends to meet up.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cb\u003eWhat adversities have you faced throughout your journey to where you are today?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eI have faced many adversities, most of which every footballer goes through in their careers, things like having low confidence, and not getting as much playing time as I’d like. I think my toughest test has been recently having to recover from offseason surgery.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cb\u003eDid you ever have moments where you felt anxious or had doubts? Where you think, maybe I’m just not cut out for this? What if something goes wrong?  \u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eThere are always times where you doubt yourself and feel anxious. It's normal, it’s part of being a human let alone being an athlete. The key is to push through those negative thoughts till you find your confidence again.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"row full-width\"\u003e\u003cimg src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/tfc-lg-3.jpg?3064\" alt=\"\" style=\"display: block; margin-left: auto; margin-right: auto;\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cb\u003eWhat would you say is the greatest change you’ve made that’s impacted your life?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eI have learned to worry about the things that are in my control and not to let the things that are not in my control make a negative impact on myself.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cb\u003eWho do you turn to for advice when everything seems to get a bit too loud?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eMy brother Anthony. He always gives me good advice when I am not feeling great.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cb\u003eWhat would you say to all of the other young footballers out there watching you when it comes to pushing past negativity?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eI would say that the bad times are only temporary as long as you work hard to get out of it, and the reward for that is always a feeling that trumps that negative feeling.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e  \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cb\u003eWhat motivates you every day, especially during times of high stress or potential burnout?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eMaking my family proud is what motivates me to push through hard times.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cb\u003eHow do you balance your relationships, whether it be your friends, family, etc?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eI always make time for the important things in my life like family, friends and work. I choose not to waste my time on things that cannot impact my life in a positive way.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/tfc-med-4.jpg?3064\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns blog-pad\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/tfc-med-5.jpg?3064\"\u003e\u003c\/div\u003e\n\u003chr class=\"hr-none\" style=\"clear: both;\"\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cb\u003eExplain your experience coming up playing soccer in Brampton? \u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eIt was great. There was a lot of really good competition in Brampton during the time I was growing up and it definitely helped me be where I am today.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cb\u003eWhat was it like playing for SC Toronto and then eventually Toronto FC? Did you always think you would end up on this path?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eI never thought my pathway to Toronto FC would ever be what it ended up being. But I believe everything happens for a reason and I wouldn't change anything about the way I came up.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cb\u003eWhen you first found out that you would be playing for Team Canada what did you feel at that very moment? \u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eIt was a great moment for me because it’s something I dreamed about as a kid. It happened pretty quickly after I signed for TFC so that made me very happy.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"row full-width\"\u003e\u003cimg src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/tfc-lg-1.jpg?3064\" alt=\"\" style=\"display: block; margin-left: auto; margin-right: auto;\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cb\u003eWhat advice would you give to a young person who intends to embark on a journey of becoming a professional athlete? But just doesn’t know where to start?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eNo matter where you start, all that matters is you keep working hard and believe in yourself! After that, everything will fall into place if it’s meant to be.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cb\u003eWhen you’re getting hype pre-game what can we usually find you listening to?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eSome J Balvin or Drake .\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cb\u003eWhat would you say your personal style is?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eEuropean\/urban street style.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/tfc2-med-18.jpg?3064\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns blog-pad\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/tfc-sm-1.jpg?3064\"\u003e\u003c\/div\u003e\n\u003chr class=\"hr-none\" style=\"clear: both;\"\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cb\u003eIf you could live anywhere in the world, where would it be?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eToronto is the best city in the world and I’m blessed :)\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cb\u003eWhat does Home is Toronto mean to you? How has this city helped shape who you are today?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eThis city means everything to me. It has molded me into the person I am today, and I'm proud of that. The different kinds of people that I have been able to meet and grow up with has taught me so much about the world and how diverse it is. The people of Toronto are proud, and hardworking people, and I would describe myself as being the same way.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cb\u003eWhat about the city inspires you the most?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eThe unity of all different cultures. I think it is what separates us from the rest of the world and it is truly inspiring.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cb\u003eWhere is your favourite place to be in Toronto when you have the day to yourself?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eOn a patio in Yorkville.\u003c\/span\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003c\/div\u003e",
            "blog_id": 22647472216,
            "author": "Yanal Dhailieh",
            "user_id": 5774835,
            "published_at": "2019-08-31T05:14:00-04:00",
            "updated_at": "2019-08-31T05:14:14-04:00",
            "summary_html": "",
            "template_suffix": null,
            "handle": "meet-jonathan-osorio",
            "tags": "",
            "admin_graphql_api_id": "gid:\/\/shopify\/OnlineStoreArticle\/30063329368",
            "image": {
                "created_at": "2019-08-28T14:50:48-04:00",
                "alt": "",
                "width": 1700,
                "height": 1133,
                "aspect_ratio": 0.8,
                "src": "https:\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/articles\/jo-1.jpg?v=1567018248"
            }
        },
        {
            "id": 29400858712,
            "title": "Meet Xavier Rathan Mayes: The road from Scarborough to the NBA",
            "created_at": "2019-06-06T11:13:24-04:00",
            "body_html": "\u003cdiv class=\"row full-width\"\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eTell us a little bit about yourself. For example, growing up what were your interests? Have they changed or did you always have a main concept\/idea in your mind that you wanted to achieve? \u003c\/span\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eGrowing up, my dad played for Florida State University so from a young age I had a ball put into my hands. I was born and brought up in Scarborough, since my dad had to come out to Toronto to play and train here. It’s been a journey coming from Toronto, specifically Scarborough. It’s what I represent, it’s been a special journey for me, especially since there have been a lot of ups and a lot of downs. My dad always talks about how there’s beauty in the struggle, and that’s definitely something I’ve experienced to achieve my dream of being in the NBA. I’m just grinding to be the best possible player, and the best possible person that I can be. I want to represent my family, my country, and my city in all the right ways, when I get the opportunity to. I want to play at a high level no matter where I am. Right now, I am out in Israel for a month and a half, trying to make the play-offs, and good money for the summer. I hope to use that money to take care of my family and travel. That’s me in a nutshell, travelling all over the world in a short period of time, and continuing to do that. \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eWhat your day to day life like? Since it may not look the same, what’s an overview of your week?\u003c\/span\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eMy biggest goal coming to Israel was obviously to help the team out with the games, and do what I love at a high level. Right now, I’m in a big push to sign an NBA contract! I’m not far off, as I’ve had the opportunity to play at the highest level in the NBA. Coming out here was special in a way because I could isolate myself from  everybody, including my friends, and family. Although they are the most important people in my life, I’ve been able to focus on transforming myself, and my body to get into the kind of shape that I want to be in. I’m focusing on giving it my all, as well as hopefully signing an NBA contract this off-season.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eFor me it’s about taking my body, and my mind to a completely new level that I have never been before. That’s my focus, and that is my day-to-day. I get up early every morning to go to the gym for 9:30am, even though practice starts at 12pm. I do my conditioning, get in a lift before practice, and then after practice I do my core. It is a very short regime, and there isn’t too much to it. I have been trying my best to get out into the city, and explore a little bit, however, like I mentioned I am here for a reason, and that reason is to really transform my mind, my body and my game. This is a push for myself, and for my family. It’s about sacrificing that short term stuff, such as going to the club, to be able to take care of your family for the long term. \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003e \u003c\/span\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/nxr-2.jpg?2343\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns blog-pad\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/nxr-9.jpg?2346\"\u003e\u003c\/div\u003e\n\u003chr class=\"hr-none\" style=\"clear: both;\"\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eWhat was the experience of joining the New York Knicks for the 2017 NBA Summer League like, as well as the LA Lakers for the 2018 Summer League? What was going through your mind, and how did it feel?\u003c\/span\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eBoth experiences were really special! They were special because I had the opportunity to be around the two biggest franchises in the NBA, those being the New York Knicks, and The Los Angeles Lakers. Last year I had a really good summer league, and played well enough to get signed. However, because of the timing of Lebron James coming in, it did not work out. The NBA is all about timing, and being in the right place at the right moment. It was tough knowing that Lebron came there, and obviously Lebron is going to bring his best because he wants to win championships. \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eRegardless, I learned a lot! This summer, wherever I am at, hopefully I can get signed! As soon as I am done in Israel, I will be taking a week off to let my body relax, and then getting right back into training. Until summer league, I’m really just preparing myself, and taking my game to another level so I can prove that I am an NBA point guard.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eWho do you seek inspiration from or look up to when it comes to basketball, and in strengthening yourself as a player? \u003c\/span\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eI watch a lot of Damian Lillard. I feel like he’s been underrated his whole life, even in the NBA! He played at the highest level and still didn’t get picked for the All-Star game. He’s my favourite point-guard in the NBA, and I try to model a bit of my game after him. I like the way he approaches things, and just the way he is a person! I’ve gotten the chance to hear a lot about him, since I’ve played with one of his teammates, Gary Trent Jr. He seems like a great guy on and off the floor, obviously a special player on the floor. He is someone that I look up to, and want to be like.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eWhat constraints have you faced throughout your journey?\u003c\/span\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eI think the first thing that comes to mind is college. I was a drafted player out of high school for being the top 20 in the country. However, I got ruled as ineligible and therefore was unable to play, which was so tough for me because basketball was taken away from me. At that point I lost the one thing that I loved the most, and I didn’t know what to do with myself. That was a point in time where I had to rebuild myself, my mind and really push myself to another level. The second biggest setback I was faced with was being undrafted. I was told that I was probably going to make second round pick, and even then, I didn’t. However, after that day I went out every single night to prove that I should have been drafted, and that I was better than any of the other players that were chosen. What I realized is that it is all about your mindset, how you look at things, and how you approach things. This doesn’t just apply to the game but in all aspects of life. What you put in is what you’re going to get out, and I put my everything into this. I’m lock in, and like I said, I’m ready to get this thing done, and there isn’t anything that is going to stop me from getting to where I want! I am super resilient in what I do, and I have to be hard-headed at times to get to where I want to be!\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003e \u003c\/span\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"row full-width\"\u003e\u003cimg src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/nxr-3.jpg?2343\" alt=\"\" style=\"display: block; margin-left: auto; margin-right: auto;\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eHow was balancing academics during your college career as well as focusing on developing a career to play for the NBA?\u003c\/span\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eIt’s always tough as a student athlete, since your time is demanded at such a high level! A lot of detail and time management goes into it. Practice is about three and a half to four hours long, and when you come home you’re tired. So it’s really about finding a balance, and ensuring that you are able to get the grades you need to stay eligible for playing. At the end of the day it’s about making sure that you don’t let anything take you off the court! That’s what my mom preached to me, that no matter what, you get things so you’re not taken off the court! \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eDo you feel anxious, or have doubts? Where you think, maybe I’m just not cut out for this? If you do, what do you tell yourself to get past those temporary feelings?\u003c\/span\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eI like to say that I’m built for this. I’ve been through the doubt, I’ve been through the fire, I’ve been through the tough times, the times that have brought me to tears, and also through the times that brought the biggest smile on my face and my family’s. I don’t think there has been a point where I’ve said I’m not able to do this. With that being said, there have obviously been tough times, which comes with everything. Nothing good in life comes without having to go through hardships and difficult times, so I try my very best to embrace those moments, and enjoy them. What I remind myself is that moments like those will make me better in the long run, and shape me into who I become. So I embrace those hardships, and welcome them. It’s all about how you look at it a situation, how you approach it, and how you take it!\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003e \u003c\/span\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eHave you experienced forms of criticism? If so, how do you deal with it and transform it into something positive?\u003c\/span\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eI’ve learned that criticism is a great thing. When I was younger I was kind of opposed to it, but now I’m all for it. I like being coached hard, I liked being told where I need to get better, as it motivates me, and helps me become a better player as well as a better person. Criticism is a good thing, it allows you to see your mistakes, it allows you to grow, and it allows you to become better. Maybe when I was younger I would have said I don’t really like criticism but now it’s a part of what I do, it’s a part of becoming a pro, and it’s a part of advancing in my career, so I see it more positively. That’s how you got to look at it in order to keep moving forward.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/nxr-5.jpg?2343\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns blog-pad\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/nxr-6.jpg?2343\"\u003e\u003c\/div\u003e\n\u003chr class=\"hr-none\" style=\"clear: both;\"\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eWhat advice would you give to a young person who intends to embark on a journey of becoming a professional athlete? But just doesn’t know where to start?\u003c\/span\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eMine is simple, and it’s something that you hear a lot, which is work hard! People always say it out of cliche, however it’s definitely how I’ve been able to separate myself from others. It has been through the hard work, dedication and details that I put into what I do. I think that’s where it all starts. The foundation of doing well is the hard work you put in what you do, and ensuring that your preparation is at an elite level. Everything else comes after that. So to somebody who doesn’t really know where to start, I think your preparation, your dedication, and the hard work that you put into what you do is the biggest thing! Everyone wants to be special, they all want to have millions of dollars, to be able to take care of their families, to live in big houses, and drive nice cars but not everyone is willing to put in the work to get there! The work is a different story. It’s about waking up at 5am and grinding while everyone else is sleeping, or staying up late at night because you’re not content, and so you go to the gym and shoot for a couple of hours by yourself. It’s the moments where nobody is watching, those are the moments that make or break you. It’s the hard work, passion and dedication of what you do on a daily basis, which is going to get you through all the other stuff and propel you forward to where you want to be. \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eWhat does Home is Toronto mean to you?\u003c\/span\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eHome is Toronto. Home is Everything. When you go back home, you feel comfortable, you feel secure, and you get a different kind of love that you don’t get anywhere else. Home is where everybody knows you, everybody understands you, everybody understands the struggles you’ve been through, and they appreciate you. Whenever I go somewhere, the first thing I say is, “I’m from Toronto”! Nothing else. Everybody knows where Toronto is, and I think we’ve done a great job of putting it on the map. Like I said, Toronto is everything to me, and it’s the place that made me who I am today, and it’s the place that is going to continue to make a lot of people. I’m proud to be from Toronto, and I definitely wear it on my sleeve every time I go out there. I got it tatted on me, as it’s important to represent my country and my city. The most special thing for me is being able to represent my city at a high level to the point that people recognize that Toronto has some really big talent! \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"row full-width\"\u003e\u003cimg src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/nxr-4.jpg?2343\" alt=\"\" style=\"display: block; margin-left: auto; margin-right: auto;\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eHow has the city shaped you into who you are today?\u003c\/span\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eScarborough is my city. Scarborough is what made me. We call it the Bermuda Triangle because guys can be crazy. Nothing is given to you there, instead, you have to earn it, and you have to earn everything that you say you are! It is a tough environment to be in but I found that it was great for me. The challenge gave me the chip on my shoulder that I have today, and it will stay with me no matter how good I am, or even if I become the best to ever come from my city. When I go back home I’ll always hear, “you’re not that good”! However, that kind of stuff is what made me, it has allowed me to have the attitude that I have, and the swagger that I step out with on the court to prove myself. It is that kind of stuff that pushes me to prove to my family, to prove to the guys in my hometown, and prove to myself that this what I do, and I’m the best at what I do. That is what has made me. Scarborough, alongside my mom and family, is what made me the person and the player I am today. \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eWho are your biggest inspirations from the city?\u003c\/span\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eDrake is definitely one! This is because of what he has done. I’ve known his two best friends, Jordan and Nico, my whole life. I grew up around them as they used to go to the Y that I go to! Drake has been a huge inspiration for me because of what he has been able to do in his life, and through the craft of music. I don’t think there is anywhere in the world that doesn’t know Drake, and that is so special. People including, Tristan Thompson and Steve Nash are who I look up to as mentors. So I’m definitely humbled and thankful to have guys like that around, as they have paved the path for us. \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/nxr-8.jpg?2346\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns blog-pad\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/files\/nxr-7.jpg?2344\"\u003e\u003c\/div\u003e\n\u003chr class=\"hr-none\" style=\"clear: both;\"\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eWhat’s one thing that you think about the most when you’re overseas away from home?  \u003c\/span\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eObviously family is one! With that said, there is also a plaza one street up from my house that has two of my favourite food spots. One is called Island and Spice, and the other is called Roti Hut. People from all over Toronto drive up to Scarborough to this one roti spot, and it is always jam packed. So whenever I am home, my grandma will always call me and ask if I want jerk chicken or roti for dinner that night. It’s interesting that when I think of home, the first thing that comes to mind is the food. The culture of food, and the culture of people. Toronto is so  multicultural, with a blend of different people throughout the city. I think that is so special because you don’t see that often. No matter where you are in the world, there seems to be some separation, however, in Toronto you got a bit of everything. You got the faces that you didn’t even know were possible.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eWhat kind of music do you enjoy listening to, especially to hype you up before a basketball game?\u003c\/span\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eI listen to Nipsey Hustle, and a little bit of Meek Mill. However, I like to listen to slow jams before my games. I don’t necessarily like to be super hyped and jumping all over the place before a game. The slow jams calm me down, and get me ready to focus on what waits ahead. If you see me play I’m really calm, cool and collected. If it’s not a slow jam, then I’ll be listening to guys like Drake, Meek and what not. It’s the best of both worlds.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003e \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eWhat would you classify your personal fashion style as?\u003c\/span\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eSince last year I’ve been getting more into fashion! I’ve been a big Nike guy, wearing tech fleece and what not. I didn’t really wear jeans, or dress up too much but Randy helped me change that! He helped me change up my style, especially when it came to appearances that I had to attend. I’ve shifted towards a different kind of style, where I put on a suit, or even go casual with nice kicks. \u003c\/span\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003c\/div\u003e",
            "blog_id": 22647472216,
            "author": "Josh Binet",
            "user_id": 26627997784,
            "published_at": "2019-07-22T09:50:00-04:00",
            "updated_at": "2019-07-25T13:10:47-04:00",
            "summary_html": "",
            "template_suffix": null,
            "handle": "meet-xavier-rathan-mayes-the-road-from-scarborough-to-the-nba",
            "tags": "",
            "admin_graphql_api_id": "gid:\/\/shopify\/OnlineStoreArticle\/29400858712",
            "image": {
                "created_at": "2019-06-06T11:20:56-04:00",
                "alt": "",
                "width": 1700,
                "height": 1133,
                "aspect_ratio": 0.8,
                "src": "https:\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/articles\/nxr-1.jpg?v=1559834456"
            }
        },
        {
            "id": 29666312280,
            "title": "Meet Liam Fraser",
            "created_at": "2019-07-17T17:11:27-04:00",
            "body_html": "\u003cdiv class=\"row full-width\"\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cb\u003eGrowing up what were your interests? Have they changed or did you always have a main concept\/idea in your mind that you wanted to achieve?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eFrom a young age soccer was a massive part of my life, and something that I knew I wanted to pursue as a career. I used to play hockey a bit as well, however, that took a big back burner as soon as I was faced with the decision to pursue a career in hockey or soccer, and obviously soccer was the one. Besides sports, my interests include music, and hanging out with friends. Overall, my appreciation for soccer has grown and it continues to grow. \u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cb\u003eWith soccer was there was there an end goal in mind that you wanted to play for a premier league MLS, overseas? \u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eMy end goal is to play for the premier league, however, there are definitely stepping stones to making my way up. I am prepared to take any path or route in order to achieve that end goal, even if it means taking a couple of steps back in order to move forward.\u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cb\u003eWhat your day to day life like? Since it may not look the same, what’s an overview of your week?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eIt’s pretty consistent besides changes that result from our game schedule. Usually I train every morning around 10:30am\/11:00am. After training is done I would usually drive one of my friends home and grab a coffee with him. Once I’m home, I do my homework and relax. We have normatec boots that we wear for recovery, so if I’m watching some TV shows, I’ll put those on for a bit. Once it’s later on in the day, I hangout with my parents and have dinner with them. It’s generally this on repeat, with a lot of resting and recovering more than anything. When we have games out of the city, there is definitely change. At that point you train, you play and you have a lot less time on your own since you’re travelling with the team. \u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn2.shopify.com\/s\/files\/1\/0488\/0597\/files\/liam-fraser-2.jpg?2787\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns blog-pad\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn2.shopify.com\/s\/files\/1\/0488\/0597\/files\/liam-fraser-3.jpg?2787\"\u003e\u003c\/div\u003e\n\u003chr class=\"hr-none\" style=\"clear: both;\"\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cb\u003eWhat sparked your interest in playing soccer, and pursuing a career to become a professional athlete? \u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eMy dad had a massive influence on me since he used to play soccer at a very high level when he was younger. Also, I would say my interest started when I was younger and I would find myself waking up early on Saturday and Sunday mornings to watch premier soccer. Seeing those athletes go out on the field, in front of those fans, and in that atmosphere, was something that I knew I wanted to be a part of. So that’s when I asked myself, is this something that I really want to pursue? And it was something that I did want to pursue, so I said why not work hard, have a go at it, and just do it! If I think I can do it, then I’m pretty confident in myself in getting it done. It’s a matter of focusing down, and wanting to be the best every day. \u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cb\u003eHow has balancing academics at Ryerson University, and your professional career as an athlete at TFC been like? \u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eBoth my parents and my sister graduated from Sir Wilfred Laurier with a business degree, which is what I’m pursuing. So a lot of the time I look to them for help. What I’ve learned is that it’s all about time management. It’s about knowing what I need to get done, especially if I’m on the road and have a test mid-week, an assignment, or even group project meeting to attend. It’s about knowing how to allocate my time correctly, when to study, and when to sacrifice being out with a friend. So it’s about being smart more than anything, being aware of what I have to do, and organizing my schedule accordingly. \u003c\/span\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"row full-width\"\u003e\u003cimg src=\"\/\/cdn2.shopify.com\/s\/files\/1\/0488\/0597\/files\/liam-fraser-4.jpg?2787\" alt=\"\" style=\"display: block; margin-left: auto; margin-right: auto;\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cb\u003eWhat was the experience of stepping on the field for your first game signed with the TFC professional league?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eIt was mad! What was going through my mind that day was how Toronto FC gave me the opportunity as a young kid from Toronto, to make it big in Toronto. I was also really happy about my parents and sister being there, that was definitely really important to me. To a certain extent I felt a moment of relief like, “hey it’s here!” I told myself at the end of the day it’s just a football game and I’ve played a thousand of these so it’s nothing new. However, looking at the atmosphere and seeing the fans that paid to see us play is something that I will never take for granted. It was a really cool moment!\u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cb\u003eWho do you seek inspiration from or look up to when it comes to soccer, and in strengthening yourself as a player? \u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eI’ll answer this question from two different perspectives. In terms of being the best person I could possibly be, I look up to my mom, my dad, my sister and my uncle. I think they’ve definitely done a great job in trying to keep my feet on the ground, and in making sure that I’m paying my dues and being a person that they all know and hopefully love. As a footballer, who is around older guys that have more experience as professional footballers, I look up to Jonathan Osorio and Ashtone Morgan. I think those guys have been massive in my development as a professional footballer, on and off the field. I owe them a lot for growing my own brand as a footballer. I spend quite a lot of time with the both of them, they both are unbelievable footballers, and are great people that I’m happy to be around all the time and learn from.  \u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cstrong\u003eWhat constraints have you faced throughout your journey?\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eA lot of time it comes down to if you’re placed in the line-up, or if you’re not. It is also a matter of being in favour with the coach, or not. Regardless, I think it’s about believing in yourself and the work that you put in more than anything else. It’s about being able to look at yourself in the mirror, knowing how much work you’re truly putting in, and how often you’re in the gym by yourself. It’s also about telling yourself that you didn’t just put all of this work in to get this far, only to give up. What helps me push through the more mental constraints is checking in on myself, whether that be just once a month. I remind myself why I am here, what I’m doing, and why this is the one thing that makes the happiest. Overall, it’s about having a strong mentality and being able to push through small times of adversity like that.\u003c\/span\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn2.shopify.com\/s\/files\/1\/0488\/0597\/files\/liam-fraser-6.jpg?2787\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"column-1 large-6 columns blog-pad\"\u003e\u003cimg alt=\"\" src=\"\/\/cdn2.shopify.com\/s\/files\/1\/0488\/0597\/files\/liam-fraser-7.jpg?2787\"\u003e\u003c\/div\u003e\n\u003chr class=\"hr-none\" style=\"clear: both;\"\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cb\u003eWhat are the greatest achievements that you’ve accomplished and are proud of ? Why are these achievements remarkable for you?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eSigning with the Toronto FC was massive to me! Being from Toronto, and being able to play for your own city is an unbelievable feeling that I don’t think many get to feel. Just knowing that you’re born and raised in the place that you’re playing is unbelievable. I’ve also been a part of the men’s national and team, and the under 20 side, where I won a couple of the events and captained. I think those are two of my favourite achievements, playing for my hometown, as well as representing my home country. Those in themselves are massive opportunities, and I’m really gracious to have being given those opportunities. \u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\u003cbr\u003e\n\u003cp\u003e\u003cb\u003eHave you experienced forms of criticism? If so, how do you deal with it and transform it into something positive?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eUsually at games it is people heckling and trying to get a reaction out of you, and so you just have to laugh it off. You can’t take it seriously, you have to know that they are trying to be malicious but to a certain extent, and so you can’t be bothered by it. However, now a days, I feel like a lot of the criticism and comments are made on social media. People feel more inclined to say stuff on Twitter, or Instagram, and once again you have to be unbothered by it. If you have a bad game, people are more likely to say something about it, but then if you have a great game, everything switches on a dime and those are the same people that will congratulate you. So just use that and be unbothered by it! None of that hate will have anything to do with the personal development of your career.\u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cb\u003eWhat habits and ways of thinking have been key to your own personal success as professional athlete?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eI think just having a driven mindset! The second that you give into the noise, you’re distracting yourself from reaching your ultimate goal. I apply this to my goal of reaching the premier league, and I believe that this is applicable to anyone else who has to take whatever steps necessary in order to achieve their goals. Once you understand that giving into the comments made by other people attempting to bring you down is just a distraction, then you won’t bother giving into it. As much as those comments might come across as bad press, it should be viewed as something that is taking your mind off of your goal, which it shouldn’t be doing. For myself personally, knowing that any distraction is not going to help me reach my final goal is enough for me to understand that it is not worth my time.\u003c\/span\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"row full-width\"\u003e\u003cimg src=\"\/\/cdn2.shopify.com\/s\/files\/1\/0488\/0597\/files\/liam-fraser-5.jpg?2787\" alt=\"\" style=\"display: block; margin-left: auto; margin-right: auto;\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"blog-questions\"\u003e\n\u003cp\u003e\u003cb\u003eWhat advice would you give to a young person who intends to embark on a journey of becoming a professional athlete? But just doesn’t know where to start?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eI think if they already know that they want to be a pro-footballer, then I would tell them that it’s all about giving that final push! It’s also about knowing, willing and wanting to sacrifice what may be certain moments as a young person in order to achieve the greater goal. It’s about knowing that you can’t be out late on certain nights of the week, that you can’t be doing certain things with your friends, and that discipline is required. It’s about sacrificing certain moments and spending that time on perfecting your craft, and what you do. I can assure them that the light is at the end of the tunnel, so if you’re able to keep that one track mindset, and know where you want to be and what you want to do, then all those small sacrifices are worth it.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e \u003c\/p\u003e\n\u003cp\u003e\u003cb\u003eWhat does Home is Toronto mean to you?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eIt means everything to me! If you ask any of my friends, they’ll tell you that I’m always talking about how Toronto is the best city in the world. Saying that this city has crafted me and the guys on the team would be an understatement. The multiculturalism, as well as the atmosphere that exists in all sporting events, is what makes us want to win, and want to succeed. The energy with every person is unbelievable. It’s a privilege to be from Toronto and and honour to represent Toronto! It’s the best city in the world!\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cb\u003eWhat about the city inspires you the most?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eThe city in itself inspires me! When I lived in Vancouver for National Team Canada, I told all my friends that they had to visit Toronto because the city has a spot for everybody. Whether that be for the different types of food, the different kinds of music, or whatever it is. Toronto is so accommodating for everybody! It’s just so inclusive and that’s the one massive thing that inspires me. Being a part of a place that wants everyone be involved is what inspires me.\u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cb\u003eWhat kind of music do you enjoy listening to, especially to hype you up before a game?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eBefore a game you’ll catch me listening to a lot of rap, and probably songs from Drake, Meek Mill, and Lil Baby. Any other day of the week I’m open to pretty much anything, it just depends on whatever the mood is, where I’m going, or what the team likes. \u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cb\u003eAny pre-game rituals?\u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eI live near Yonge and Eglinton, so I’ll usually go for an hour long walk the morning of a game. After my walk I would grab coffee from this shop near my house called, De Mello. Also, you’ll catch me hanging around Yonge Street for a bit, and probably grabbing my pre-game meal from this butcher called, Canada Market. Then I would walk home and just hangout there.\u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cb\u003eWhat would you classify your personal fashion style as? \u003c\/b\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eI switch up my style a lot! I wear jeans, I wear cargo pants, I wear trousers. It depends on where I’m going and what I’m feeling that particular day. I rarely wear joggers or sweatpants, it’s usually cargo, jeans or trousers. It depends on the occasion. To games, I would usually do a dress pant or a pleated pants, and go a bit more formal. If I’m on the road, cargo. If i’m just hanging out, then I’m really flexible. I’m not trying to replicate anyone, I hope it doesn't seem like I am. A lot of it just me doing me! I’m smart about what I spend it on, and stick in between my funds brackets. I’m very conscious about what I’m wearing, and making sure that I like the way I look before going out. I have to make sure I’m cozy whether I’m walking down the street, or driving to Toronto!\u003c\/span\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003c\/div\u003e",
            "blog_id": 22647472216,
            "author": "Yanal Dhailieh",
            "user_id": 5774835,
            "published_at": "2019-07-18T09:39:00-04:00",
            "updated_at": "2019-07-18T09:39:33-04:00",
            "summary_html": "",
            "template_suffix": null,
            "handle": "meet-liam-fraser",
            "tags": "",
            "admin_graphql_api_id": "gid:\/\/shopify\/OnlineStoreArticle\/29666312280",
            "image": {
                "created_at": "2019-07-17T17:25:35-04:00",
                "alt": "",
                "width": 1700,
                "height": 1133,
                "aspect_ratio": 0.8,
                "src": "https:\/\/cdn.shopify.com\/s\/files\/1\/0488\/0597\/articles\/liam-fraser-1.jpg?v=1563398735"
            }
        }
    ]
}